"""
Метод: format
-------------
Перша цифра у номері пластикової картки означає, до якої платіжної системи вона належить. Усі картки Visa мають
номер, що починається на "4", Mastercard - на "5", а American Express - "3". Якщо картку видала не кредитна
організація, номер може починатися з інших цифр. "1" і "2" - це різні авіалінії, "3" - організації сфери
подорожей та розваг, «6» - мерчендайзингові компанії, «7» - паливні, «8» - підприємства у сфері
телекомунікацій, а «9» - це державні асигнації.
"""
pay_system = {
    5: 'Mastercard',
    4: 'Visa',
    3: 'American Express'
}

card_numbers = ["5375123444449999", "4168884433335412", '3676323232323232323', "41688844333354bv", "16888d44333354bv"]

def is_valid(card):
    return card.isdigit() and len(card) == 16

for card in card_numbers:
    string = "Номер картки {:<16} Платіжна система: {:^16} карта валідна: {:>16}"
    print(string.format(card, pay_system.get(int(card[0]), "unknown"), (is_valid(card))))