# Округлення чисел

"""
Згідно з офіційною документацією:
- ROUND_FLOOR: число заокруглюється до негативної нескінченності.
- ROUND_CEILING: число округляється до нескінченності або позитивної нескінченності.
- ROUND_HALF_DOWN: числа округляються до найближчого числа. Якщо є нічия, число заокруглюється до нуля. Зв'язки - це рівновіддалені числа, які можна округляти як у більшу, так і меншу сторону. Наприклад, таке число, як 4,25 можна округлити як у бік 4,2, так і 4,3.
- ROUND_HALF_UP: числа округляються до найближчого числа. Якщо є нічия, число заокруглюється від нуля.
- ROUND_UP: число заокруглюється від нуля.
- ROUND_DOWN: число заокруглюється до нуля.
- ROUND_HALF_EVEN: числа округляються до найближчого числа.
Будь-які зв'язки округляються до найближчого парного цілого числа.
- ROUND_05UP: числа округляються від нуля, якщо останнє число дорівнює 0 або 5. Якщо ні, числа округляються до нуля.
За замовчуванням округлення описується константою ROUND_HALF_EVEN
"""
from decimal import Decimal, ROUND_HALF_EVEN, ROUND_HALF_UP
num = Decimal("1.45")
print(num.quantize(Decimal("1.0"), rounding=ROUND_HALF_EVEN))  # За замовчуванням округлення описується константою ROUND_HALF_EVEN

print(num.quantize(Decimal("1.0"), rounding=ROUND_HALF_UP))

print(Decimal("3.14159").quantize((Decimal("1.000"))))


